spring-ws-security/src/test/resources/org/springframework/ws/soap/security/noSecurityHeader-soap.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tru="https://fabrikam123.com/payloads">
    <SOAP-ENV:Header>
    	<tru:DummyHeader/>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <tru:StockSymbol>QQQ</tru:StockSymbol>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
